package day12;

public class StudentManagerTest {
	
	public static void main(String[] args) {
			/*  학생 성적 관리 프로그램을 작성하세요.
			 *  -작성하기 위해 필요한 작업들을 주석으로 정리해보세요.
			 *  1. 프로그램에 필요한 기능을 정리
			 *  메뉴(1. 학생정보추가, 2.학생성적추가, 3.학생정보출력, 4.프로그램 종료)
			 *  
			 *  
			 *  2. 프로그램 실행 과정은 어떻게 할 건지? 
			 *  기능
				 *  1) 학생정보추가
				 *  	- 학년, 반, 번호, 이름을 입력하여 학생 정보 추가
				 *  	- 학년, 반, 번호가 같은 학생이 이미 있으면 추가하지 않음.
				 *  
				 *  2) 학생 성적 추가
				 *  	- 학년 반 번호로 학생을 '검색'한 후 '있으면' 성적을 추가
				 *  	- 성적 추가시 과목명, 학기, 중간, 기말, 수행평가를 입력하여 추가
				 *  	- 이미 추가된 과목(학기와 과목명이 같으면)이면 추가하지 않음.
				 *  3) 학생 정보 출력
				 *  
				 *  4) 종료
			 *  
			 *  
			 *  3. 정보를 효율적으로 관리하기 위해 클래스를 만들 것인가.
			 *  	만든다면 어떤 클래스를 만들 것인가?
			 *  	-학생 클래스 HighStudent
			 *  	-성적 클래스 Score
			 *  
			 *  4. 프로그램 실행 과정을 주석으로 작성
			 */
		
	/*
	 * 필요한 요소: 학생클래스(이름, 학년, 반, 번호, 성적) 
	 * 	학생 관리용 묶음(배열?)
	 * 	성적클래스-학생의 멤버(국어, 수학, 영어, 메소드: 평균, 총합)
	 *  main에 넣을 프로그램{1. 학생 기입, 2.학생 수정(불필요) 3. 학생성적 열람.
	 *  4. 종료 
	 *  main용 메소드들(selectMenu, printMenu, runMenu)
	 *   
	 *   
	 *  } 
	 *  
	 * 			 	
	 */
		
		
		
		
		
	}
	

	

}
